{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v1.0",
    "convertedBy": null,
    "modelTopology": {
      "keras_version": "2.2.4",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential_1",
          "layers": [
            {
              "class_name": "Flatten",
              "config": {
                "name": "flatten_1",
                "trainable": true,
                "batch_input_shape": [null, 28, 28, 1],
                "dtype": "float32"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "units": 128,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                }
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "units": 10,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                }
              }
            }
          ]
        }
      }
    },
    "weightsManifest": [
      {
        "paths": ["weights.bin"],
        "weights": [
          {
            "name": "dense_1/kernel",
            "shape": [784, 128],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [128, 10],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  